<?php
/**
 * Created by PhpStorm.
 * User: kx
 * Date: 2016/10/25
 * Time: 15:04
 */
return array(
    '10000' => '保存图片失败',
    '10001' => '时间戳校验失败',
    '10002' => '时间戳不能为空',
    '10003' => '用户ID不能为空',
    '10004' => 'token不能为空',
    '10005' => '签名不能为空',
    '10006' => 'token验证失败',
    '10007' => '签名验证失败',
    '10008' => '支付返回签名验证失败',
    '10009' => '该功能暂不可用，请稍后重试',
    '10010' => '链接错误',
    '10011' => '必须包含session_key',
    '10012' => 'session_key不合法',
    '10013' => '验证码错误',
    '10014' => '发送短信失败，请稍后重试',
    '10015' => '获取open_id失败',
    '10016' => '发送消息通知失败',
    '10017' => '解密失败',
    '-41001' => 'encodingAesKey 非法',
    '-41002' => 'Iv 非法',
    '-41003' => 'aes 解密失败',
    '-41004' => '解密后得到的buffer非法',
);