<?php
/**
 * Created by PhpStorm.
 * User: kx
 * Date: 2016/10/25
 * Time: 15:04
 */
return array(
    '10000' => '密码错误',
    '10001' => '商户已关闭',
    '10002' => '请等待管理员审核',
    '10003' => '审核未通过',
    '10004' => 'token生成失败',
    '10005' => '用户名错误',
    '10006' => 'refresh_token失败',
    '10007' => 'refresh_token信息有误',
    '10008' => 'refresh_token已过期',
    '10009' => 'refresh_token和用户名不匹配',
    '10010' => '新建用户失败',
    '10011' => '该账号已被注册',
    '10012' => '商户信息有误',
    '10013' => '用户信息有误',
    '10014' => '用户已存在',
    '10015' => '用户不存在',
    '10016' => '新增商品失败',
    '10017' => '条形码已存在',
    '10018' => '商品信息有误',
    '10019' => '库存量超过11位',
    '10020' => '客户信息有误',
    '10021' => '银行卡号已存在',
    '10022' => '银行卡信息有误',
    '10023' => '删除银行卡失败',
    '10024' => '减少库存失败',
    '10025' => '保存订单详情失败',
    '10026' => '订单信息有误',
    '10027' => '订单已付款，无法修改',
    '10028' => '该订单已退单',
    '10029' => '产品ID不属于该订单',
    '10030' => '该订单未付款，无法退单',
    '10031' => '该订单已付款',
    '10032' => '该商户未开启支付',
    '10033' => '当支付目的为还款时，还款金额不能为空',
    '10034' => '还款金额不能大于欠款金额',
    '10035' => '支付订单号信息有误',
    '10036' => '订单已取消',
    '10037' => '订单已完成',
    '10038' => '没有权限修改',
    '10039' => '此微信号已绑定',
    '10040' => '此微信号未绑定',
    '10041' => '地址信息有误',
    '10042' => '保存订单信息失败',
    '10043' => '商家未接单',
    '10044' => '该订单已反馈'
);